-- 1. The list of all airlines for a given airport.
SELECT * FROM AIRLINE 
NATURAL JOIN AIRPORT
where airportName = 'Los Angeles International Airport';

-- 2. The list of all flights for a given airline. Sorted by: a. starting location b. destination c. longest flight d. shortest flight
SELECT * FROM FLIGHTSCHEDULE S
INNER JOIN FLIGHTINSTANCE F
ON S.FSID = F.FSID
WHERE AIRLINE = 'Delta Airlines'
ORDER BY 
DEPARTUREAIRPORT;
-- ARRIVALAIRPORT;
-- SINGLEFLIGHTTIME DESC;
-- SINGLEFLIGHTTIME ASC;

-- 3. Flights that charge for extras (water, etc.)
SELECT * FROM OTHER O
LEFT JOIN FLIGHTINSTANCE F
ON O.FSID= F.FSID
WHERE isofferamenity = true;

--4. The crew roster for each flight for each airline
SELECT C.FAANUMBER,C.FIID,NAME,AIRLINE FROM crewassignment AS C
INNER JOIN CREWMATE M
ON C.FAANUMBER = M.FAANUMBER
INNER JOIN flightinstance AS F
ON C.FIID = F.FIID
INNER JOIN flightschedule AS S
ON F.FSID = S.FSID
ORDER BY C.FIID;

--5 The trips that are available if you do make one stop over
SELECT DISTINCT F1.DEPARTUREAIRPORT,F1.ARRIVALAIRPORT,F2.DEPARTUREAIRPORT,F2.ARRIVALAIRPORT,F1.FSID,F2.FSID FROM FLIGHTSCHEDULE F1, FLIGHTSCHEDULE F2
WHERE F1.ARRIVALAIRPORT = F2.DEPARTUREAIRPORT AND F1.DEPARTUREAIRPORT <> F2.ARRIVALAIRPORT AND F1.AIRLINE = F2.AIRLINE;

--6 a.arriving flights per city
SELECT ARRIVALAIRPORT,AIRPORTCITY,COUNT(*) AS "ARRIVING FLIGHTS" FROM FLIGHTINSTANCE I
INNER JOIN FLIGHTSCHEDULE S
ON I.FSID = S.FSID
INNER JOIN AIRPORT A
ON A.FAAABBREVIATION = S.ARRIVALAIRPORT
GROUP BY ARRIVALAIRPORT,AIRPORTCITY;

--6 c.list of airlines in each service category
SELECT AIRLINE,'DOMESTIC/LOCAL' AS "SERVICE CATEGORY" FROM OTHER O
INNER JOIN FLIGHTINSTANCE F
ON O.FSID = F.FSID
INNER JOIN FLIGHTSCHEDULE S
ON S.FSID = F.FSID
UNION
SELECT AIRLINE,'INTERNATIONAL' AS "SERVICE CATEGORY" FROM INTERNATIONAL I
INNER JOIN FLIGHTINSTANCE F
ON I.FSID = F.FSID
INNER JOIN FLIGHTSCHEDULE S
ON S.FSID = F.FSID;

--6d.crews that fly multiple flights in a single day
SELECT C1.FAANUMBER FROM (SELECT F.FIID,C.FAANUMBER FROM FLIGHTINSTANCE F
INNER JOIN CREWASSIGNMENT C ON F.FIID = C.FIID) AS C1
INNER JOIN (SELECT F.FIID, C.FAANUMBER FROM FLIGHTINSTANCE F
INNER JOIN CREWASSIGNMENT C ON F.FIID = C.FIID) AS C2
ON C1.FSID = C2.FSID
WHERE C1.FIID <> C2.FIID;

--7 A list of all incident reports by A flight
SELECT DESCRIPTION,I.FIID,TYPE,DATE FROM INCIDENTREPORT I
INNER JOIN INCIDENTENUM E
ON E.ID = I.INCIDENTTYPE
INNER JOIN FLIGHTINSTANCE F
ON I.FIID = F.FIID;

--8 Flights that are scheduled to depart in three days
SELECT * FROM FLIGHTINSTANCE   
where {fn timestampdiff(SQL_TSI_DAY , CURRENT_DATE,DATE)} = 3;

--9 All flights that arrived in the busiest airport in the last week
SELECT * FROM FLIGHTINSTANCE F
NATURAL JOIN (SELECT ARRIVALAIRPORT,DEPARTUREAIRPORT,COUNT(*) AS MYSUM FROM FLIGHTINSTANCE I
INNER JOIN FLIGHTSCHEDULE S
ON I.FSID = S.FSID
INNER JOIN AIRPORT A
ON A.FAAABBREVIATION = S.ARRIVALAIRPORT
WHERE {fn timestampdiff(SQL_TSI_DAY , CURRENT_DATE,DATE)} < 7 AND {fn timestampdiff(SQL_TSI_DAY ,CURRENT_DATE,DATE)} > -10
GROUP BY ARRIVALAIRPORT,DEPARTUREAIRPORT) Y
WHERE Y.MYSUM = (SELECT MAX(Y.MYSUM) 
FROM (SELECT ARRIVALAIRPORT,DEPARTUREAIRPORT,COUNT(*) AS MYSUM FROM FLIGHTINSTANCE I INNER JOIN FLIGHTSCHEDULE S ON I.FSID = S.FSID INNER JOIN AIRPORT A ON A.FAAABBREVIATION = S.ARRIVALAIRPORT
WHERE {fn timestampdiff(SQL_TSI_DAY , CURRENT_DATE,DATE)} < 7 AND {fn timestampdiff(SQL_TSI_DAY ,CURRENT_DATE,DATE)} > -10
GROUP BY ARRIVALAIRPORT,DEPARTUREAIRPORT) Y);


SELECT FIID,ARRIVALAIRPORT,FSID FROM(SELECT ARRIVALAIRPORT,DEPARTUREAIRPORT,COUNT(*) AS MYSUM FROM FLIGHTINSTANCE I
INNER JOIN FLIGHTSCHEDULE S
ON I.FSID = S.FSID
INNER JOIN AIRPORT A
ON A.FAAABBREVIATION = S.DEPARTUREAIRPORT
WHERE {fn timestampdiff(SQL_TSI_DAY , CURRENT_DATE,DATE)} > -8 AND {fn timestampdiff(SQL_TSI_DAY ,CURRENT_DATE,DATE)} <1
GROUP BY ARRIVALAIRPORT,DEPARTUREAIRPORT) Y
NATURAL JOIN FLIGHTSCHEDULE S
NATURAL JOIN FLIGHTINSTANCE F
WHERE Y.MYSUM = (SELECT MAX(Y.MYSUM) FROM (SELECT ARRIVALAIRPORT,DEPARTUREAIRPORT,COUNT(*) AS MYSUM FROM FLIGHTINSTANCE I
INNER JOIN FLIGHTSCHEDULE S
ON I.FSID = S.FSID
INNER JOIN AIRPORT A
ON A.FAAABBREVIATION = S.ARRIVALAIRPORT
WHERE {fn timestampdiff(SQL_TSI_DAY , CURRENT_DATE,DATE)} > -8 AND {fn timestampdiff(SQL_TSI_DAY ,CURRENT_DATE,DATE)} < 1
GROUP BY ARRIVALAIRPORT,DEPARTUREAIRPORT)AS Y)
AND {fn timestampdiff(SQL_TSI_DAY , CURRENT_DATE,DATE)} >-8 AND {fn timestampdiff(SQL_TSI_DAY ,CURRENT_DATE,DATE)} <1;


SELECT ARRIVALAIRPORT,DEPARTUREAIRPORT,COUNT(*) AS MYSUM FROM FLIGHTINSTANCE I
INNER JOIN FLIGHTSCHEDULE S
ON I.FSID = S.FSID
INNER JOIN AIRPORT A
ON A.FAAABBREVIATION = S.ARRIVALAIRPORT
WHERE {fn timestampdiff(SQL_TSI_DAY , CURRENT_DATE,DATE)} < 7 AND {fn timestampdiff(SQL_TSI_DAY ,CURRENT_DATE,DATE)} > -10
GROUP BY ARRIVALAIRPORT,DEPARTUREAIRPORT;

-- No.10
select * from FLIGHTINSTANCE FI
inner join FLIGHTSCHEDULE F on FI.FSID = F.FSID
where {fn timestampdiff(SQL_TSI_MINUTE , F.ESTIMATEDDEPARTURETIME, FI.ACTUALDEPARTURETIME)} > 30;

--11 A temperature weather report that has a value below 2.
SELECT FIID,TYPE,VALUE FROM WEATHERREPORT W
INNER JOIN WEATHERENUM E
ON W.REPORTTYPE = E.ID
WHERE VALUE <2;

--11BThe crewmate FAA-Number that flies on a Flight Instance that uses HA341 airplane and has a single flight time above 5 hours.
SELECT FAANUMBER
FROM CREWASSIGNMENT C
INNER JOIN FLIGHTINSTANCE F
ON C.FIID = F.FIID
WHERE TAILNUMBER = 'HA341' AND SINGLEFLIGHTTIME> 5;

--11CHealth Test that is taken between June and December and they have a score above 80.
SELECT * FROM HEALTHTEST
WHERE (MONTH(DATE) BETWEEN 6 AND 12) AND TESTSCORE >80;
--11D Every airplane that has an Accumulated flight time GREATER THAN 2000 and is set to be under maintenance between July to November.
SELECT * FROM PLANES P
INNER JOIN MAINTENANCE M
ON P.TAILNUMBER = M.TAILNUMBER
WHERE (MONTH(DATE) BETWEEN 7 AND 11 ) AND ACCUMULATEDFLIGHTTIME > 2000;
